{"config": {"layers": [{"inbound_nodes": [], "name": "the_input", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "the_input", "batch_input_shape": [null, 128, 32, 1], "sparse": false}}, {"inbound_nodes": [[["the_input", 0, 0, {}]]], "name": "conv1", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "use_bias": true, "padding": "same", "trainable": true, "data_format": "channels_last", "name": "conv1", "kernel_regularizer": null, "filters": 16, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "max1", "class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max1", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": true}}, {"inbound_nodes": [[["max1", 0, 0, {}]]], "name": "conv2", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "use_bias": true, "padding": "same", "trainable": true, "data_format": "channels_last", "name": "conv2", "kernel_regularizer": null, "filters": 16, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["conv2", 0, 0, {}]]], "name": "max2", "class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max2", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": true}}, {"inbound_nodes": [[["max2", 0, 0, {}]]], "name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.3}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "reshape", "class_name": "Reshape", "config": {"target_shape": [32, 128], "name": "reshape", "trainable": true}}, {"inbound_nodes": [[["reshape", 0, 0, {}]]], "name": "dense1", "class_name": "Dense", "config": {"activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 32, "use_bias": true, "trainable": true, "name": "dense1", "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}}, {"inbound_nodes": [[["dense1", 0, 0, {}]]], "name": "biLSTM1", "class_name": "Bidirectional", "config": {"merge_mode": "concat", "name": "biLSTM1", "trainable": true, "layer": {"config": {"activation": "tanh", "recurrent_regularizer": null, "kernel_constraint": null, "units": 256, "stateful": false, "trainable": true, "go_backwards": false, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "recurrent_dropout": 0.0, "unroll": false, "return_sequences": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "implementation": 1, "use_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "name": "lstm_1", "return_state": false, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0}, "class_name": "LSTM"}}}, {"inbound_nodes": [[["biLSTM1", 0, 0, {}]]], "name": "biLSTM2", "class_name": "Bidirectional", "config": {"merge_mode": "concat", "name": "biLSTM2", "trainable": true, "layer": {"config": {"activation": "tanh", "recurrent_regularizer": null, "kernel_constraint": null, "units": 256, "stateful": false, "trainable": true, "go_backwards": false, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "recurrent_dropout": 0.0, "unroll": false, "return_sequences": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "implementation": 1, "use_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "name": "lstm_2", "return_state": false, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0}, "class_name": "LSTM"}}}, {"inbound_nodes": [[["biLSTM2", 0, 0, {}]]], "name": "dense2", "class_name": "Dense", "config": {"activation": "linear", "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "units": 44, "use_bias": true, "trainable": true, "name": "dense2", "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}}, {"inbound_nodes": [[["dense2", 0, 0, {}]]], "name": "softmax", "class_name": "Activation", "config": {"activation": "softmax", "name": "softmax", "trainable": true}}, {"inbound_nodes": [], "name": "the_labels", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "the_labels", "batch_input_shape": [null, 32], "sparse": false}}, {"inbound_nodes": [], "name": "input_length", "class_name": "InputLayer", "config": {"dtype": "int64", "name": "input_length", "batch_input_shape": [null, 1], "sparse": false}}, {"inbound_nodes": [], "name": "label_length", "class_name": "InputLayer", "config": {"dtype": "int64", "name": "label_length", "batch_input_shape": [null, 1], "sparse": false}}, {"inbound_nodes": [[["softmax", 0, 0, {}], ["the_labels", 0, 0, {}], ["input_length", 0, 0, {}], ["label_length", 0, 0, {}]]], "name": "ctc", "class_name": "Lambda", "config": {"name": "ctc", "output_shape": [1], "function_type": "lambda", "trainable": true, "arguments": {}, "function": ["4wEAAAAAAAAABQAAAAUAAABDAAAAc00AAAB8AABcBAB9AQB9AgB9AwB9BAB8AQBkAABkAACFAgBk\nAQBkAACFAgBkAABkAACFAgBmAwAZfQEAdAAAagEAfAIAfAEAfAMAfAQAgwQAUykCTukCAAAAKQLa\nAUvaDmN0Y19iYXRjaF9jb3N0KQXaBGFyZ3PaBnlfcHJlZNoGbGFiZWxz2gxpbnB1dF9sZW5ndGja\nDGxhYmVsX2xlbmd0aKkAcgkAAAD6US9ob21lL3NlYXNvbi9EZXNrdG9wL0NSTk5fQ1RDX0VuZ2xp\nc2hfSGFuZHdyaXRpbmdfUmVjb2duaXRpb24tbWFzdGVyL3NyYy91dGlscy5wedoPY3RjX2xhbWJk\nYV9mdW5jDAAAAHMGAAAAAAESAyUB\n", null, null], "output_shape_type": "raw"}}], "name": "model_1", "input_layers": [["the_input", 0, 0], ["the_labels", 0, 0], ["input_length", 0, 0], ["label_length", 0, 0]], "output_layers": [["ctc", 0, 0]]}, "keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Model"}