{"backend": "tensorflow", "keras_version": "2.2.2", "config": {"output_layers": [["ctc", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "name": "the_input", "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 128, 32, 1], "name": "the_input"}}, {"inbound_nodes": [[["the_input", 0, 0, {}]]], "name": "conv1", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 16, "name": "conv1", "use_bias": true, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "activation": "relu", "padding": "same", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "max1", "class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max1", "padding": "valid"}}, {"inbound_nodes": [[["max1", 0, 0, {}]]], "name": "conv2", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 16, "name": "conv2", "use_bias": true, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "activation": "relu", "padding": "same", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["conv2", 0, 0, {}]]], "name": "max2", "class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max2", "padding": "valid"}}, {"inbound_nodes": [[["max2", 0, 0, {}]]], "name": "dropout_1", "class_name": "Dropout", "config": {"trainable": true, "seed": null, "rate": 0.3, "name": "dropout_1", "noise_shape": null}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "reshape", "class_name": "Reshape", "config": {"trainable": true, "target_shape": [32, 128], "name": "reshape"}}, {"inbound_nodes": [[["reshape", 0, 0, {}]]], "name": "dense1", "class_name": "Dense", "config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "name": "dense1", "trainable": true, "kernel_constraint": null, "units": 32, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["dense1", 0, 0, {}]]], "name": "biLSTM1", "class_name": "Bidirectional", "config": {"trainable": true, "layer": {"config": {"stateful": false, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "recurrent_dropout": 0.0, "go_backwards": false, "kernel_regularizer": null, "name": "lstm_1", "dropout": 0.0, "use_bias": true, "kernel_constraint": null, "units": 256, "activity_regularizer": null, "activation": "tanh", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "return_state": false, "recurrent_regularizer": null, "unit_forget_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "trainable": true, "unroll": false, "return_sequences": true, "implementation": 1}, "class_name": "LSTM"}, "name": "biLSTM1", "merge_mode": "concat"}}, {"inbound_nodes": [[["biLSTM1", 0, 0, {}]]], "name": "biLSTM2", "class_name": "Bidirectional", "config": {"trainable": true, "layer": {"config": {"stateful": false, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "recurrent_dropout": 0.0, "go_backwards": false, "kernel_regularizer": null, "name": "lstm_2", "dropout": 0.0, "use_bias": true, "kernel_constraint": null, "units": 256, "activity_regularizer": null, "activation": "tanh", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "return_state": false, "recurrent_regularizer": null, "unit_forget_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "trainable": true, "unroll": false, "return_sequences": true, "implementation": 1}, "class_name": "LSTM"}, "name": "biLSTM2", "merge_mode": "concat"}}, {"inbound_nodes": [[["biLSTM2", 0, 0, {}]]], "name": "dense2", "class_name": "Dense", "config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "name": "dense2", "trainable": true, "kernel_constraint": null, "units": 44, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}}, {"inbound_nodes": [[["dense2", 0, 0, {}]]], "name": "softmax", "class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "softmax"}}, {"inbound_nodes": [], "name": "the_labels", "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 32], "name": "the_labels"}}, {"inbound_nodes": [], "name": "input_length", "class_name": "InputLayer", "config": {"dtype": "int64", "sparse": false, "batch_input_shape": [null, 1], "name": "input_length"}}, {"inbound_nodes": [], "name": "label_length", "class_name": "InputLayer", "config": {"dtype": "int64", "sparse": false, "batch_input_shape": [null, 1], "name": "label_length"}}, {"inbound_nodes": [[["softmax", 0, 0, {}], ["the_labels", 0, 0, {}], ["input_length", 0, 0, {}], ["label_length", 0, 0, {}]]], "name": "ctc", "class_name": "Lambda", "config": {"trainable": true, "output_shape": [1], "function_type": "lambda", "output_shape_type": "raw", "function": ["4wEAAAAAAAAABQAAAAUAAABDAAAAc00AAAB8AABcBAB9AQB9AgB9AwB9BAB8AQBkAABkAACFAgBk\nAQBkAACFAgBkAABkAACFAgBmAwAZfQEAdAAAagEAfAIAfAEAfAMAfAQAgwQAUykCTukCAAAAKQLa\nAUvaDmN0Y19iYXRjaF9jb3N0KQXaBGFyZ3PaBnlfcHJlZNoGbGFiZWxz2gxpbnB1dF9sZW5ndGja\nDGxhYmVsX2xlbmd0aKkAcgkAAAD6US9ob21lL3NlYXNvbi9EZXNrdG9wL0NSTk5fQ1RDX0VuZ2xp\nc2hfSGFuZHdyaXRpbmdfUmVjb2duaXRpb24tbWFzdGVyL3NyYy91dGlscy5wedoPY3RjX2xhbWJk\nYV9mdW5jDAAAAHMGAAAAAAESAyUB\n", null, null], "arguments": {}, "name": "ctc"}}], "input_layers": [["the_input", 0, 0], ["the_labels", 0, 0], ["input_length", 0, 0], ["label_length", 0, 0]]}, "class_name": "Model"}